Limpeza e preparação dos dados

1. Como tratar dados ausentes

In [2]:
import pandas as pd
import numpy as np

In [3]:
string_data = pd.Series(['fusrodah', 'midvrshaan', np.nan, 'dragon shouts'])
string_data

0         fusrodah
1       midvrshaan
2              NaN
3    dragon shouts
dtype: object

In [4]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
# o valor do Python 'None' também é tratado como NA em arrays de objetos
string_data[0] = None

string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [6]:
string_data.notnull() # negação do isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [7]:
# dropna() remove valores faltantes

# NaT é um dado de data faltante
df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'], "toy": [np.nan, 'Batmobile', 'Bullwhip'], 
                   "born": [pd.NaT, pd.Timestamp("1940-04-25"), pd.NaT]})

df

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [8]:
df.dropna() # axis='index' é o padrão

     name        toy       born
1  Batman  Batmobile 1940-04-25

In [9]:
df.dropna(axis='columns') # remove colunas em que há valores faltantes

       name
0    Alfred
1    Batman
2  Catwoman

In [10]:
# df.dropna(how='all') # remove todas as linhas em que todos os seus elementos estão faltando
df.dropna(thresh=2) # mantém linhas com pelo menos 2 valores não faltantes

       name        toy       born
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [11]:
df.dropna(subset=['name', 'toy']) # define em quais colunas procurar por valores faltantes

       name        toy       born
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

Filtrando dados ausentes

podemos usar o pandas.isnull() e usar uma indexação booleana, mas o método dropna pode ser útil

In [12]:
from numpy import nan as NA

data = pd.Series([1, NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [13]:
data_bool = data.notnull()
data[data_bool]
# ou somente: data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [14]:
# ou usando o dropna()
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

usando dropna com DataFrames

In [15]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [16]:
# padrão: excluir as linhas que têm um valor ausente
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [17]:
data.dropna(axis='columns')

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [18]:
# exclui uma linha que tenha todos os elementos como NaN
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [19]:
df = pd.DataFrame(np.random.randn(7, 3))
df

          0         1         2
0  1.132702  0.461594 -0.957149
1  2.460364  0.794681  0.781619
2  0.666527 -0.182135  1.075394
3  0.502792  1.268053 -1.516479
4  0.873722  0.236491  1.921731
5 -1.468053 -0.913307  0.783047
6  0.529441  2.047962  0.553471

In [20]:
df.iloc[:4, 1] = pd.NA
df.iloc[:2, 2] = pd.NA
df

          0         1         2
0  1.132702       NaN       NaN
1  2.460364       NaN       NaN
2  0.666527       NaN  1.075394
3  0.502792       NaN -1.516479
4  0.873722  0.236491  1.921731
5 -1.468053 -0.913307  0.783047
6  0.529441  2.047962  0.553471

In [21]:
df.dropna()

          0         1         2
4  0.873722  0.236491  1.921731
5 -1.468053 -0.913307  0.783047
6  0.529441  2.047962  0.553471

In [22]:
df.dropna(thresh=2)

          0         1         2
2  0.666527       NaN  1.075394
3  0.502792       NaN -1.516479
4  0.873722  0.236491  1.921731
5 -1.468053 -0.913307  0.783047
6  0.529441  2.047962  0.553471

Preenchendo dados ausentes usando fillna

In [23]:
df.fillna(0)

          0         1         2
0  1.132702  0.000000  0.000000
1  2.460364  0.000000  0.000000
2  0.666527  0.000000  1.075394
3  0.502792  0.000000 -1.516479
4  0.873722  0.236491  1.921731
5 -1.468053 -0.913307  0.783047
6  0.529441  2.047962  0.553471

In [24]:
df.fillna({1: 0.5, 2: 0}) # chave é a coluna, valor é aquele que ficará no lugar do dado faltante

          0         1         2
0  1.132702  0.500000  0.000000
1  2.460364  0.500000  0.000000
2  0.666527  0.500000  1.075394
3  0.502792  0.500000 -1.516479
4  0.873722  0.236491  1.921731
5 -1.468053 -0.913307  0.783047
6  0.529441  2.047962  0.553471

fillna devolve um novo objeto, mas o objeto pode ser alterado in-place

In [25]:
_ = df.fillna(0, inplace=True)
df

          0         1         2
0  1.132702  0.000000  0.000000
1  2.460364  0.000000  0.000000
2  0.666527  0.000000  1.075394
3  0.502792  0.000000 -1.516479
4  0.873722  0.236491  1.921731
5 -1.468053 -0.913307  0.783047
6  0.529441  2.047962  0.553471

In [26]:
data = pd.Series([1., NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [27]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

Transformação de dados

2. Removendo duplicatas: sempre podemos encontrar linhas duplicadas em um DataFrame

In [28]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'], 'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [29]:
# duplicated de DataFrame devolve uma Series booleana informando se a linha é uma duplicata
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [30]:
# drop_duplicates devolve um DataFrame com dados em que o array duplicated é False
data.drop_duplicates() # ou data[~(data.duplicated())]

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

esse método considera todas as colunas, mas podemos passar um subconjunto específico na detecção de duplicatas.

In [31]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [32]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

drop_duplicates, por padrão, mantém a primeira combinação de valores observados. Passar keep='last' devolverá a última.

In [33]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

transformando dados usando função ou um mapeamento

In [34]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami', 'corned beef', 'Bacon', 'pastrami', 'honey ham', 'nova lox'], 
										 'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [35]:
# vamos adicionar uma coluna com o tipo de animal
meat_to_animal = {
	'bacon': 'pig',
	'pulled pork': 'pig',
	'pastrami': 'cow',
	'corned beef': 'cow',
	'honey ham': 'pig',
	'nova lox': 'salmon'
}

In [36]:
# precisamos converter os dados do DataFrame para que todos tenham letras minúsculas!
lowercased =  data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [37]:
lowercased.map(meat_to_animal)

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [38]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [39]:
# poderíamos usar uma função
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

explicando a instrução usada acima `data['food'].map(lambda x: meat_to_animal[x.lower()])`

 - `data['food']` seleciona a coluna 'food'
 - `.map()` aplica uma função a cada elemento da coluna do DataFrame
 - `lambda x: meat_to_animal[x.lower()]` função aplicada a cada elemento da coluna 'food'; a função lambda pega cada elemento da coluna 'food', converte para minúscula com `.lower()` e usa esse valor para buscar um valor correspondente no dicionário ‘meat_to_animal’.

usar map é uma forma de fazer transformações em todos os elementos e executar outras operações relacionadas à limpeza de dados.

3. substituindo valores

In [40]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [41]:
# '-999' podem ser valores de sentinela para dados faltantes e podemos substituir isso por NA com replace, gerando uma nova Series
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [42]:
# para substituir vários valores de uma vez, passamos uma lista com estes valores
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [43]:
# para um substituto diferente para cada valor, passamos uma lista com eles
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [44]:
# ou usando um dicionário
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

4. renomeando os índices dos eixos

In [45]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)), index=['Ohio', 'Colorado', 'New York'], columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [46]:
transform = lambda x: x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [47]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

podemos criar uma versão transformada de um conjunto de dados sem modificar os dados originais usando rename

In [48]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [49]:
# podemos passar um dicionário com os novos valores (apenas os que serão alterados)
data.rename(index={'OHIO': 'INDIANA'}, columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [50]:
# para modificar o DataFrame in-place
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

5. discretização [é o processo de dividir os dados em partes menores e menos complexas] e compartimentação (binning) [é separar os dados em compartimentos para análise]

In [51]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

dividiremos esses dados em compartimentos de 18 a 25, 26 a 35, 36 a 60 e, por fim, 61 anos ou mais usando a função cut do Pandas

In [52]:
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [53]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [54]:
pd.value_counts(cats)

C:\Users\ludmila\AppData\Local\Temp\ipykernel_2260\1485279302.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(cats)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
Name: count, dtype: int64

In [55]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

6. detectando e filtrando valores discrepantes (outliers)

In [56]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.024947    -0.008852     0.029152     0.040801
std       0.988573     0.969469     0.972319     1.021825
min      -3.178036    -3.620364    -3.248108    -3.404399
25%      -0.698729    -0.649726    -0.598865    -0.614147
50%      -0.048078     0.030401    -0.040903     0.026733
75%       0.668151     0.661742     0.695974     0.730426
max       3.451937     2.886077     3.143153     3.667602

In [57]:
data

            0         1         2         3
0    0.744112 -0.046101 -1.673351 -1.086129
1   -0.619122  1.803805  0.020522  1.417817
2   -0.760144  1.393142  0.171009  0.613921
3   -1.712189  0.806836  0.673237 -0.936103
4    0.795115  0.534991 -0.933951  0.416392
..        ...       ...       ...       ...
995  1.562314 -0.496207 -0.002862 -0.050121
996 -1.121167  1.069738 -1.051242  1.246904
997 -0.638902  0.783233 -0.463640 -0.275904
998  1.562083  0.554616 -0.579459  1.077224
999  0.242980  1.558484 -1.752968 -0.086619

[1000 rows x 4 columns]

In [58]:
# para encontrar valores que excedem 3 em valor absoluto em uma das colunas, por exemplo
col = data[2]
col

0     -1.673351
1      0.020522
2      0.171009
3      0.673237
4     -0.933951
         ...
995   -0.002862
996   -1.051242
997   -0.463640
998   -0.579459
999   -1.752968
Name: 2, Length: 1000, dtype: float64

In [59]:
col[np.abs(col) > 3]

33     3.143153
565   -3.248108
590   -3.078795
Name: 2, dtype: float64

`sign()` retorna -1 if x < 0, 0 if x==0, 1 if x > 0. nan é retornado para nan inputs

In [60]:
# eliminar os valores que estejam fora do intervalo de –3 a 3
data[np.abs(data) > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.025221    -0.008232     0.029335     0.040913
std       0.986531     0.967352     0.970815     1.015289
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.698729    -0.649726    -0.598865    -0.614147
50%      -0.048078     0.030401    -0.040903     0.026733
75%       0.668151     0.661742     0.695974     0.730426
max       3.000000     2.886077     3.000000     3.000000

7. permutação e amostragem aleatória: permutar (que é reordenar aleatoriamente) uma Series ou as linhas de um DataFrame pode ser feito utilizando a função numpy.random.permutation

In [61]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [62]:
sampler = np.random.permutation(5)
sampler

array([3, 2, 4, 1, 0])

In [63]:
# esse array  pode ser usado na indexação baseada em iloc ou na função take equivalente
df.take(sampler) # ou df.iloc[sampler]

    0   1   2   3
3  12  13  14  15
2   8   9  10  11
4  16  17  18  19
1   4   5   6   7
0   0   1   2   3

In [64]:
# selecionar um subconjunto aleatório sem substituição
df.sample(n=3)

    0   1   2   3
2   8   9  10  11
4  16  17  18  19
0   0   1   2   3

In [65]:
# para gerar uma amostra com substituição (a fim de permitir opções repetidas), usamos replace=True
choices = pd.Series([5, 7, -1, 6, 4])
draws = choices.sample(n=10, replace=True)
draws

2   -1
2   -1
3    6
4    4
1    7
1    7
0    5
2   -1
1    7
4    4
dtype: int64

8. calculando variáveis indicadores/dummy: se uma coluna em um DataFrame tiver k valores distintos, poderíamos derivar uma matriz ou um DataFrame com k colunas contendo somente 1s e 0s

In [66]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'], 'data1': range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [67]:
pd.get_dummies(df['key'])

       a      b      c
0  False   True  False
1  False   True  False
2   True  False  False
3  False  False   True
4   True  False  False
5  False   True  False

In [68]:
dummies = pd.get_dummies(df['key'], prefix='key')
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0  False   True  False
1      1  False   True  False
2      2   True  False  False
3      3  False  False   True
4      4   True  False  False
5      5  False   True  False

Manipulação de Strings

In [70]:
val = 'a, b, guido'
val.split(',')

['a', ' b', ' guido']

In [71]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [72]:
first, second, third = pieces
first + '::' + second + '::' + third

'a::b::guido'

In [73]:
# uma forma melhor de escrever isso:
'::'.join(pieces)

'a::b::guido'

In [74]:
'guido' in val

True

In [75]:
val.index(',')

1

In [76]:
val.find(':')

-1

a diferença entre find e index é que find retorna '-1' caso a substring não seja encontrada e index lança uma exceção

In [77]:
val.count(',')

2

In [80]:
val, val.replace(', ', '::'), val.replace(',', '')

('a, b, guido', 'a::b::guido', 'a b guido')